In [1]:
import pandas as pd
import warnings
import os

In [2]:
os.chdir("nfl_data")
warnings.filterwarnings('ignore')

In [3]:
players_df = pd.read_csv("players.csv")
players_df

,nflId,height,weight,birthDate,collegeName,position,displayName
0,25511,6-4,225,1977-08-03,Michigan,QB,Tom Brady
1,29550,6-4,328,1982-01-22,Arkansas,T,Jason Peters
2,29851,6-2,225,1983-12-02,California,QB,Aaron Rodgers
3,30842,6-6,267,1984-05-19,UCLA,TE,Marcedes Lewis
4,33084,6-4,217,1985-05-17,Boston College,QB,Matt Ryan
...,...,...,...,...,...,...,...
1678,55200,6-6,266,NaN,Indiana,DT,Ryder Anderson
1679,55212,6-0,230,NaN,Iowa State,ILB,Jake Hummel
1680,55239,6-2,300,NaN,Pennsylvania,DT,Prince Emili
1681,55240,6-1,185,NaN,Buffalo,CB,Ja'Marcus Ingram
1682,55241,6-2,280,NaN,Coastal Carolina,DT,C.J. Brewer

In [4]:
players_df = players_df[["nflId", "height", "weight", "birthDate", "position"]]
players_df

      nflId height  weight   birthDate position
0     25511    6-4     225  1977-08-03       QB
1     29550    6-4     328  1982-01-22        T
2     29851    6-2     225  1983-12-02       QB
3     30842    6-6     267  1984-05-19       TE
4     33084    6-4     217  1985-05-17       QB
...     ...    ...     ...         ...      ...
1678  55200    6-6     266         NaN       DT
1679  55212    6-0     230         NaN      ILB
1680  55239    6-2     300         NaN       DT
1681  55240    6-1     185         NaN       CB
1682  55241    6-2     280         NaN       DT

[1683 rows x 5 columns]

In [5]:
def feet_to_inches(height: str | float) -> int | float:
    if isinstance(height, float):
        return height
    feet, inches = height.split("-")
    return int(feet) * 12 + int(inches)

In [6]:
players_df["height"] = players_df["height"].apply(feet_to_inches)
players_df

      nflId  height  weight   birthDate position
0     25511      76     225  1977-08-03       QB
1     29550      76     328  1982-01-22        T
2     29851      74     225  1983-12-02       QB
3     30842      78     267  1984-05-19       TE
4     33084      76     217  1985-05-17       QB
...     ...     ...     ...         ...      ...
1678  55200      78     266         NaN       DT
1679  55212      72     230         NaN      ILB
1680  55239      74     300         NaN       DT
1681  55240      73     185         NaN       CB
1682  55241      74     280         NaN       DT

[1683 rows x 5 columns]

In [7]:
from datetime import datetime

In [8]:
def birthdate_to_age(birthdate: str | float) -> int | None:
    if isinstance(birthdate, float):
        return birthdate
    try:
        date = datetime.strptime(birthdate, "%Y-%m-%d")
    except ValueError:
        date = datetime.strptime(birthdate, "%m/%d/%Y")
    now = datetime(2022, 11, 7)
    return int(((now - date)).days / 365.25)

In [9]:
players_df["age"] = players_df["birthDate"].apply(birthdate_to_age)
players_df

      nflId  height  weight   birthDate position   age
0     25511      76     225  1977-08-03       QB  45.0
1     29550      76     328  1982-01-22        T  40.0
2     29851      74     225  1983-12-02       QB  38.0
3     30842      78     267  1984-05-19       TE  38.0
4     33084      76     217  1985-05-17       QB  37.0
...     ...     ...     ...         ...      ...   ...
1678  55200      78     266         NaN       DT   NaN
1679  55212      72     230         NaN      ILB   NaN
1680  55239      74     300         NaN       DT   NaN
1681  55240      73     185         NaN       CB   NaN
1682  55241      74     280         NaN       DT   NaN

[1683 rows x 6 columns]

In [10]:
#games df
games_df = pd.read_csv("games.csv")
games_df

,gameId,season,week,gameDate,gameTimeEastern,homeTeamAbbr,visitorTeamAbbr,homeFinalScore,visitorFinalScore
0,2022090800,2022,1,09/08/2022,20:20:00,LA,BUF,10,31
1,2022091100,2022,1,09/11/2022,13:00:00,ATL,NO,26,27
2,2022091101,2022,1,09/11/2022,13:00:00,CAR,CLE,24,26
3,2022091102,2022,1,09/11/2022,13:00:00,CHI,SF,19,10
4,2022091103,2022,1,09/11/2022,13:00:00,CIN,PIT,20,23
...,...,...,...,...,...,...,...,...,...
131,2022110607,2022,9,11/06/2022,13:00:00,WAS,MIN,17,20
132,2022110608,2022,9,11/06/2022,16:05:00,ARI,SEA,21,31
133,2022110609,2022,9,11/06/2022,16:25:00,TB,LA,16,13
134,2022110610,2022,9,11/06/2022,20:20:00,KC,TEN,20,17
135,2022110700,2022,9,11/07/2022,20:15:00,NO,BAL,13,27